//-------------------------------------------------------------------------------------------------
// File : imguiPS.hlsl
// Desc : Pixel Shader For ImGui.
// Copyright(c) Project Asura. All right reserved.
//-------------------------------------------------------------------------------------------------

#include "a3dShader.hlsli"

///////////////////////////////////////////////////////////////////////////////////////////////////
// VSOutput sturcture
///////////////////////////////////////////////////////////////////////////////////////////////////
struct VSOutput
{
    A3D_LOCATION(0) float4 Position : SV_POSITION;      //!< 位置座標
    A3D_LOCATION(1) float4 Color    : COLOR;            //!< カラー
    A3D_LOCATION(2) float2 TexCoord : TEXCOORD;         //!< テクスチャ座標.
};

///////////////////////////////////////////////////////////////////////////////////////////////////
// PSOutput sturcture
///////////////////////////////////////////////////////////////////////////////////////////////////
struct PSOutput
{
    A3D_LOCATION(0) float4 Target0  : SV_TARGET0;       //!< レンダーターゲット0.
};

//=================================================================================================
// Samplers and Textures.
//=================================================================================================
A3D_BINDING(1) SamplerState ColorSmp : register(s0);
A3D_BINDING(2) Texture2D    ColorMap : register(t0);

//-------------------------------------------------------------------------------------------------
//      ピクセルシェーダメインエントリーポイントです.
//-------------------------------------------------------------------------------------------------
PSOutput main(VSOutput input)
{
    PSOutput output = (PSOutput)0;

    output.Target0 = input.Color * ColorMap.Sample(ColorSmp, input.TexCoord);

    return output;
}
