//-------------------------------------------------------------------------------------------------
// File : imguiPS.hlsl
// Desc : Pixel Shader For ImGui.
// Copyright(c) Project Asura. All right reserved.
//-------------------------------------------------------------------------------------------------

#include "spirvHelper.hlsli"

///////////////////////////////////////////////////////////////////////////////////////////////////
// VSOutput sturcture
///////////////////////////////////////////////////////////////////////////////////////////////////
struct VSOutput
{
    LOCATION(0) float4 Position : SV_POSITION;      //!< 位置座標
    LOCATION(1) float4 Color    : COLOR;            //!< カラー
    LOCATION(2) float2 TexCoord : TEXCOORD;         //!< テクスチャ座標.
};

///////////////////////////////////////////////////////////////////////////////////////////////////
// PSOutput sturcture
///////////////////////////////////////////////////////////////////////////////////////////////////
struct PSOutput
{
    LOCATION(0) float4 Target0  : SV_TARGET0;       //!< レンダーターゲット0.
};

//=================================================================================================
// Samplers and Textures.
//=================================================================================================
RESOURCE(SamplerState   ColorSmp, s0, 1);      //!< カラーサンプラー.
RESOURCE(Texture2D      ColorMap, t0, 2);      //!< カラーテクスチャ.


//-------------------------------------------------------------------------------------------------
//      ピクセルシェーダメインエントリーポイントです.
//-------------------------------------------------------------------------------------------------
PSOutput main(VSOutput input)
{
    PSOutput output = (PSOutput)0;

    output.Target0 = input.Color * ColorMap.Sample(ColorSmp, input.TexCoord);

    return output;
}
